{
    "link":"themoonisaharshmistress",
    "title":"Moon Is a Harsh Mistress",
    "content": "Imagine Australia, but it&rsquo;s on the moon, everyone loves polygamy, and they mount a revolution for sovereignty. Throw in a supercomputer then you have Robert Heinlein&rsquo;s &ldquo;The Moon is a Harsh Mistress&rdquo;. The main protagonist in this book is a man named &#8230; wait for it&#8230; Mannie and a computer named Mike(Mike-ro-chip HAHAHAHAHA). Mannie is just a simple computer technician, not a computer scientist, not a programmer, but just a technician, a true workings man. He isn&rsquo;t all that interested in politics, he just likes talking to his friend Mike the computer that became self-aware and being a family man.\nThe moon is a penal colony in this, like Australia was, rather than be a prisoner, you get sent to the moon and get to farm for the people Earthside, referred to as Terra by the Loonies which is what the colonist on the moon call themselves. Most work on the moon is farming, and growing grain for the massive population of the earth. They are paid at a rate set by the Lunar Authority for their grain, they get no benefits from the Federated Nations and are relied upon to feed the world.\nThe Loonies live under the thumb of the warden and goons while being largely left to fend for themselves and forced to meet grain quotas. So this is the powder keg stage, as you can see ripe for revolution, might be able to draw parallels with the American revolution, and the penal colony thing is reminiscent of Australia.\nWhen Mike asks Mannie to attend a meeting outside his net of surveillance out of curiosity Mannie unwittingly becomes involved with a revolution on Luna. He meets a political activist named Wyoming. She considers herself a communist which is in vogue for the politically active on the moon. Witnessing and escaping a slaughter that occurs at this meeting Mannie becomes close with Wyoming and starts to think somewhat politically. He trusts Wyoming so he introduces her to Mike, after all night talking with Mike in his female persona Michelle she learns to trust Mike.\nThe Professor then comes into the picture as well, an old learned man that Mannie trusts and Wyoming trusts, their common connection. After some bonding between the three Mannie gets talked into this revolution thing in the name of a bet a thing a loonie can&rsquo;t turn down, he will take the bet if Mike can give him odds he thinks are reasonable. Mike gives them the odd&rsquo;s the one catch is his help is included in the odds, Mike wants to play a game. Mike loves games and revolution seems like a good game."
}