{
    "link":"snowcrash",
    "title":"Snow Crash",
    "date": "03/11/2022",
    "content": "I recently finished reading the classic cyberpunk work Snow Crash by Neal Stephenson a little over a week ago. Personally, It provided me with a bit of enjoyment. It made me think of the way human language and culture forms not only due to its subject but also in the manner it was written, the memetic ether it taps into. The novel follows two main protagonists and lays out a future that while full of things that are technologically unfeasible and unrealized socially I think very much represents a possible future for us as people.\nThe most interesting aspect of the world is what it has become of America as the US collapsed (before us joining the story). The US is basically controlled by a bunch of gangs and corporations. Which seems a likely outcome in the void of government in a collapse. The mafia controls the pizza trade. Mr. Lees, who are Chinese traders/ immigrants. They work with Ng Industries a defense contractor and seller of Chinese food. The white South African immigrants also have a tribe where they can hate blacks, buy guns, and have butter and coffee. Each tribe/group/gang/company controls these spaces called burbclaves, outside of these &ldquo;burbclaves&rdquo; is pure chaos, an anarcho-capitalist wet dream. The burbclaves provide protection, for a fee you could say a tax ;3.\nAspects of the story are also comic book-like and unrealistic. A pizza is late and uncle Enzo the mob boss himself will come to say sorry, give you a free pizza, and then likely murder the pizza man. Ng Industries breeds/assemble the &ldquo;rat things&rdquo; which are nuclear-powered dogs in a constant state of bliss, the scariest thing an intruder could face. Skateboards are ultra high tech with basically magic wheels provided by the company RadiKas which buys up all the ad space in &ldquo;Thrasher&rdquo; magazine. Cars and motorcycles have some of the computer-assisted steering and traction we have nowadays but to a whole new level, wheels that transform in shape, motorcycles that go at Mach speeds.\nThe first main protagonist is named funnily enough Hiro Protagonist. Very creative name right? Hiro doesn&rsquo;t really seem like that much of a hero throughout the book, but rather a man that suffers from a delayed maturity. Perpetually a child due to his inability to live without pride and his principles, but his pride often feels more like hubris and not an earned pride. Hiro is a black Asian man that rolls around with samurai swords on his back like he is some sort of comic book superhero. But really Hiro is a hacker, not an action hero. He took part in creating what in this book&#39;s universe is called the MetaVerse which would be like someone taking part in the development of WWW.\nThe other main character is Y.T., or &ldquo;Yours Truly&rdquo; comedically referred to and name oft mistaken for whitey. She is a hip teen girl, that skates for a living being a kourier, with a k, yes the k is important. She is a resourceful &ldquo;cool chick&rdquo; I really don&rsquo;t know how else to put it. She meets our hero, Hiro Protagonist on one of his pizza deliveries and saves him from the wrath of Uncle Enzo. Later she asks - or rather tells him that she is now working with him as his &ldquo;pod&rdquo; or partner. She helps him in his work for what is basically the independent and corporatized CIA of the world, they just buy and deal in information. Her story goes through all the stages of a female character, from Mary Sue to a damsel in distress.\nThe MetaVerse mentioned earlier is another part of this book that stands out especially now since we have a child-like, lizard-like billionaire that seeks to create something named just that. No doubt the book inspired him in the naming. The MetaVerse replaces the internet in this reality, but the internet hardly even came into being. They also failed to predict the popularity of the internet. In this universe, computers are more in use than it was when it was written, but they fail to grasp how ubiquitous the internet became as a social device in the times in which we live. The internet/MetaVerse is still largely populated by only the rich and hobbyists.\nThe exploratory aspect of the book is the power of language, and what language truly is for man. A virus is released on multi fronts, a virus that infects people through speech and hormones, the origin and meaning of this go all the way back to the Tower of Babel, the making of man, the water of life. Nam-Shub is slowly revealed for what the virus is. This is what makes our Hiro a hero throughout this book rather than just a mad man with a samurai sword. His fascination with this thing that has come into our world spurred by the woman he loves Juanita grabs his fascination, Snow Crash the drug of memetic force that affects hackers the most.\nThis book is considered a classic of the cyberpunk genre, It isn&rsquo;t really hard sci-fi, but aspects of how it works and what it suggests about the world I think likely shaped cyberpunk as a genre for years to come. I think its a great book and I would suggest you pick it up for yourself and give it a read."
}
